---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpatialElementGeometryCalculator
source: html/b866b81b-e79a-e779-f2e2-83f4b22fb317.htm
---
# SpatialElementGeometryCalculator Properties

Specifies whether the .NET object represents a valid Revit entity.